In [1]:
import pandas as pd

In [2]:
students = pd.DataFrame([['Alice', 'Smith', 146],
                         ['John', 'Smith', 374],
                         ['Samantha', 'Brown', 238]
                         ], columns=['first_name', 'last_name', 'id'])
students

  first_name last_name   id
0      Alice     Smith  146
1       John     Smith  374
2   Samantha     Brown  238

In [11]:
grades = pd.DataFrame([[146, 4, 5],
                       [375, 5, 3],
                       [238, 4, 5]], columns=['id', 'Algebra', 'Calculus'])
grades

    id  Algebra  Calculus
0  146        4         5
1  375        5         3
2  238        4         5

In [14]:
students.merge(grades, 'left', left_on='id', right_on='id')

  first_name last_name   id  Algebra  Calculus
0      Alice     Smith  146      4.0       5.0
1       John     Smith  374      NaN       NaN
2   Samantha     Brown  238      4.0       5.0

In [15]:
students.merge(grades, 'outer', left_on='id', right_on='id')

  first_name last_name   id  Algebra  Calculus
0      Alice     Smith  146      4.0       5.0
1       John     Smith  374      NaN       NaN
2   Samantha     Brown  238      4.0       5.0
3        NaN       NaN  375      5.0       3.0

In [17]:
grades.set_index('id', inplace=True)

In [18]:
grades

     Algebra  Calculus
id
146        4         5
375        5         3
238        4         5

In [20]:
students.set_index('id', inplace=True)

In [21]:
students

    first_name last_name
id
146      Alice     Smith
374       John     Smith
238   Samantha     Brown

In [23]:
students.join(grades, how='outer')

    first_name last_name  Algebra  Calculus
id
146      Alice     Smith      4.0       5.0
238   Samantha     Brown      4.0       5.0
374       John     Smith      NaN       NaN
375        NaN       NaN      5.0       3.0